; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	spectrograph1 - mode
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation6 - direction
	Star2 - direction
	Star1 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite1 Star8)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 planet7 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet7)
   goals met: 0 of 6
5. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 2 of 6
8. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 2 of 6
9. (take_image satellite1 star11 instrument3 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 3 of 6
10. (turn_to satellite1 star9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star9)
   goals met: 3 of 6
11. (take_image satellite1 star9 instrument3 infrared0)
   added: (have_image star9 infrared0)
   goals met: 4 of 6
12. (turn_to satellite1 star8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star8)
   goals met: 5 of 6
13. (take_image satellite1 star8 instrument3 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 6
